{
  "heroSection": {
    "companyLogo": "/assets/caseStudy/epifiLogo.png",
    "description": "Hassle-free Money Management. No commissions, no minimum balance. Easy planning, reliable support, top-notch security. Smart digital banking.",
    "backgroundStyle": "background: #00B899; color: #ffffff;"
  },
  "challenges_Services_Section": {
    "CHALLENGES_DATA": {
      "ChallengeTitle": "The Challenge",
      "ChallengeDescription": "FI approached us with clearly defined outcomes in mind - they wanted to become the best digital bank in India, by not only ensuring their products are up to par, but also providing a secure, efficient, and easy-to-navigate platform for their customers.",
      "BriefTitle": " Our brief was to:",
      "BriefPoints": [
        "Develop a robust website that makes it easy for customers to use their digital banking services in India.",
        "Develop an efficient waitlist and onboarding workflow",
        "Keep room for regular updates",
        "Create a platform that can be customised and tweaked as per the brand’s needs"
      ],
      "months": "5",
      "countryName": "India"
    },
    "SERVICES_PROVIDED_DATA": {
      "data": [
        {
          "serviceLogo": "/assets/caseStudy/Developed_Website.png",
          "serviceName": "Developed Website"
        },
        {
          "serviceLogo": "/assets/caseStudy/Waitlist_onboardingworkflow.png",
          "serviceName": "Waitlist onboarding workflow"
        },
        {
          "serviceLogo": "/assets/caseStudy/Regular_updates.png",
          "serviceName": "Regular updates"
        }
      ]
    },
    "TECHNOLOGIES_USED_DATA": {
      "imagesData": [
        {
          "techName": "Angular",
          "techImage": "/assets/frontend/angular.png"
        },
        {
          "techName": "Node Js",
          "techImage": "/assets/images/nodejs.png"
        },
        {
          "techName": "MySQL",
          "techImage": "/assets/images/mysql.png"
        },
        {
          "techName": "Redis",
          "techImage": "/assets/images/redis.png"
        },
        {
          "techName": "S3",
          "techImage": "/assets/caseStudy/s3.png"
        }
      ]
    }
  },
  "processSection": {
    "description": "After a series of brainstorming sessions and ideation calls with the client, our team was ready to begin the SDLC. With our Agile workflow, we ensured that the website and app would be developed in time, with plenty of room for feedback and improvements along the way. We used cutting-edge technologies such as MySQL, Redis, S3, Angular 8, and Node to create the perfect custom software for the client."
  },
  "resultSection": {
    "title":"The Result",
    "description": "One of the highlights of the development process for FI was the client’s involvement at every stage. Due to this, we were able to leverage the creativity that comes with a collaborative effort. As a team, we developed a highly robust website and app for FI that not only showcased all their services, but also made it very easy for their customers to start investing and saving money. \n Our onboarding and waitlist system ensured that no customer felt invisibile at any stage. As a team, we are a part of FIs growth story. Our maintenance team is always available to update and upgrade the app as per the evolving needs of the customers and FI itself. Our platform is easy to customise as per the growth requirements, and is emerging as one of the best digital financial services in india.",
    "image": "/assets/caseStudy/visacard.png"
  },
  "otherServicesSection": {
    "title": "Browse through other services that we provide",
    "data": [
      {
        "serviceImage": "/assets/caseStudy/StaffAugmentation.png",
        "serviceDescription": "We find the best Talent for you!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      },
      {
        "serviceImage": "/assets/caseStudy/buildmanage.png",
        "serviceDescription": "Not just Building, We also Manage your Products!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      }
    ]
  }
}