{
  "heroSection": {
    "companyLogo": "/assets/caseStudy/freshworksLogo.png",
    "description": "India's leading SaaS provider for custom software and scalable solutions. Delight customers in IT, Service Management, Customer Engagement, and Support.",
    "backgroundStyle": "background-image:url('/assets/caseStudy/freshworksBackground.png');color: #1A284D;",
    "maskStyle":"background: rgba(255, 255, 255, 0.96);"
  },
  "challenges_Services_Section": {
    "CHALLENGES_DATA": {
      "ChallengeTitle": "The Challenge",
      "ChallengeDescription": "Freshworks approached us with a wonderful opportunity - they needed a technology partner who could create scalable solutions, multiple apps, and a great platform that works robustly to meet their needs.",
      "BriefTitle": "Our brief was to:",
      "BriefPoints": [
        "Deliver multiple apps",
        "Integrate the best third-party solutions",
        "Integrate second-party solutions while using middleware applications",
        "Develop a fantastic UI"
      ],
      "months": "5",
      "countryName": "India"
    },
    "SERVICES_PROVIDED_DATA": {
      "data": [
        {
          "serviceLogo": "/assets/svgs/BusinessProcesses.svg",
          "serviceName": "15 custom apps"
        },
        {
          "serviceLogo": "/assets/svgs/WebDevelopmentLogo.svg",
          "serviceName": "Integrated agileCRM"
        },
        {
          "serviceLogo": "/assets/svgs/uxLogo.svg",
          "serviceName": "Integrated Frontapp"
        }
      ]
    },
    "TECHNOLOGIES_USED_DATA": {
      "imagesData": [
        {
          "techName": "Angular",
          "techImage": "/assets/frontend/angular.png"
        },
        {
          "techName": "Node Js",
          "techImage": "/assets/images/nodejs.png"
        },
        {
          "techName": "MySQL",
          "techImage": "/assets/images/mysql.png"
        },
        {
          "techName": "Redis",
          "techImage": "/assets/images/redis.png"
        },
        {
          "techName": "AWS",
          "techImage": "/assets/images/aws.png"
        },
        {
          "techName": "DataDog",
          "techImage": "/assets/caseStudy/datadog.png"
        }
      ]
    }
  },
  "processSection": {
    "description": "The Process: We started off the project by scheduling a series of workshops with the client to better understand the value they are contributing to their clients as well as the unique offerings for the customers. In this case the clients of Freshworks also used to be there on the call.With doing multiple meetings with the client, we not only simplified our own planning process but also had a clearer picture of the requirement. This enabled us to create the best custom applications. With a clear roadmap, we began work on Freshworks. We leveraged a variety of tools and technology, such as Java Script, Node JS, React JS to develop the deliverables. As a team, we implemented an Agile workflow and ensured that the client could be a part of every stage of development. With this, we were able to implement feedback, redirect efforts, and brainstorm on the go without losing any time."
  },
  "resultSection": {
    "title":"The Result",
    "description": "The project was a resounding success. We delivered 15 custom apps that fully met Freshwork's customer service requirements. Our team seamlessly integrated Frontapp, syncing email and calendar functionalities. We developed exceptional UIs for each app, ensuring a great user experience. By integrating AgileCRM, we ensured flawless data synchronization and positioned Freshworks as a leading customer service company. As a result, we established a long-term partnership with the client.",
    "image": "/assets/caseStudy/freshworksLaptop.png"
  },
  "otherServicesSection": {
    "title": "Browse through other services that we provide",
    "data": [
      {
        "serviceImage": "/assets/caseStudy/StaffAugmentation.png",
        "serviceDescription": "We find the best Talent for you!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      },
      {
        "serviceImage": "/assets/caseStudy/buildmanage.png",
        "serviceDescription": "Not just Building, We also Manage your Products!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      }
    ]
  }
}
