{
  "heroSection": {
    "companyLogo": "/assets/caseStudy/freshworksLogo.png",
    "description": "Freshworks is one of the leading names in India when it comes to offering SaaS to clients. With custom software and easily scalable solutions, Freshworks makes it easy for clients across industries to delight their customers with the perfect solutions. Freshworks offers IT and Enterprise Service Management (including IT service management software solutions), Customer Engagement Solutions, and Customer Service (including Cloud based CRM solutions) and Support solutions, which is why they are the best business services SaaS company.",
    "backgroundStyle": "background-image:url('/assets/caseStudy/freshworksBackground.png');color: #1A284D;",
    "maskStyle":"background: rgba(255, 255, 255, 0.96);"
  },
  "challenges_Services_Section": {
    "CHALLENGES_DATA": {
      "ChallengeTitle": "The Challenge",
      "ChallengeDescription": "The Client approached us with an exciting challenge: we needed to implement solutions that would appeal to a modern customer, while keeping in mind business objectives regarding scalability. This meant that any product created for the client would have to be as self-sufficient as possible, with minimal maintenance down the line. ",
      "BriefTitle": "",
      "BriefPoints": [
        "Develop a robust website that makes it easy for customers to use their digital banking services in India.",
        "Develop an efficient waitlist and onboarding workflow",
        "Keep room for regular updates",
        "Create a platform that can be customised and tweaked as per the brand’s needs"
      ],
      "months": "5",
      "countryName": "India"
    },
    "SERVICES_PROVIDED_DATA": {
      "data": [
        {
          "serviceLogo": "/assets/svgs/BusinessProcesses.svg",
          "serviceName": "15 custom apps"
        },
        {
          "serviceLogo": "/assets/svgs/WebDevelopmentLogo.svg",
          "serviceName": "Integrated agileCRM"
        },
        {
          "serviceLogo": "/assets/svgs/uxLogo.svg",
          "serviceName": "Integrated Frontapp"
        }
      ]
    },
    "TECHNOLOGIES_USED_DATA": {
      "imagesData": [
        {
          "techName": "Angular",
          "techImage": "/assets/frontend/angular.png"
        },
        {
          "techName": "Node Js",
          "techImage": "/assets/images/nodejs.png"
        },
        {
          "techName": "MySQL",
          "techImage": "/assets/images/mysql.png"
        },
        {
          "techName": "Redis",
          "techImage": "/assets/images/redis.png"
        },
        {
          "techName": "AWS",
          "techImage": "/assets/images/aws.png"
        },
        {
          "techName": "DataDog",
          "techImage": "/assets/caseStudy/datadog.png"
        }
      ]
    }
  },
  "processSection": {
    "description": "The Process: We started off the project by scheduling a series of workshops with the client to better understand the value they are contributing to the hospitality industry, as well as the unique offerings for the customers. As a result of this, we not only simplified our own planning process but also had a clearer picture of the MVP and ultimate product. This enabled us to create the best hotel management software. With a clear roadmap, we began work on Bloom’s deliverables. We leveraged a variety of tools and technology, such as Angular, Node, SQL, Redis and AWS S3 to develop the deliverables. As a team, we implemented an Agile workflow and ensured that the client could be a part of every stage of development. With this, we were able to implement feedback, redirect efforts, and brainstorm on the go without losing any time."
  },
  "resultSection": {
    "description": "Despite a tight timeline, we were armed with a strong knowledge base and an ever-relentless can-do attitude, which is what enabled us to deliver a world-class PWA for Bloom. The PWA was built after monitoring the behavioral patterns of the client’s target audience, in order to ensure easy onboarding, great functionality, and appealing aesthetics.",
    "image": "/assets/caseStudy/freshworksLaptop.png"
  },
  "otherServicesSection": {
    "title": "Browse through other services that we provide",
    "data": [
      {
        "serviceImage": "/assets/caseStudy/StaffAugmentation.png",
        "serviceDescription": "We find the best Talent for you!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      },
      {
        "serviceImage": "/assets/caseStudy/buildmanage.png",
        "serviceDescription": "Not just Building, We also Manage your Products!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      }
    ]
  }
}