{
  "heroSection": {
    "companyLogo": "/assets/caseStudy/jarLogo.png",
    "description": "Jar is a celebrated app that helps its patrons save money by investing in digital gold. The app simplifies the investment process by rounding up daily spends, and allocating the excess funds towards purchasing digital gold. With automated investments, Jar has proven to be one of the best digital gold investment apps for young investors who want to grow their wealth.",
    "backgroundStyle": "background-image: url('/assets/caseStudy/herojar.png');color: #ffffff;"
  },
  "challenges_Services_Section": {
    "CHALLENGES_DATA": {
      "ChallengeTitle": "The Challenge",
      "ChallengeDescription": "The client needed a scalable product that was not only simple to use, but would appeal to young customers who are accosted with apps and software daily.",
      "BriefTitle": " Our brief was to:",
      "BriefPoints": [
        "Help the client with a successful launch",
        "Implement technologies with ample room for flexibility and growth",
        "Integrate a secure payments gateway",
        "Create a secure and stable ecosystem for the product to exist in"
      ],
      "months": "5",
      "countryName": "India"
    },
    "SERVICES_PROVIDED_DATA": {
      "data": [
        {
          "serviceLogo": "/assets/caseStudy/Secure_infrsa.png",
          "serviceName": "Secure Infrastructure"
        },
        {
          "serviceLogo": "/assets/caseStudy/Product_Launch.png",
          "serviceName": "Product Launch"
        },
        {
          "serviceLogo": "/assets/caseStudy/Payment_Gateway.png",
          "serviceName": "Payment Gateway"
        }
      ]
    },
    "TECHNOLOGIES_USED_DATA": {
      "imagesData": [
        {
          "techName": "React",
          "techImage": "/assets/frontend/react-icon.png"
        },
        {
          "techName": "PostgreSQL",
          "techImage": "/assets/images/postgresql.png"
        },
        {
          "techName": "AWS",
          "techImage": "/assets/images/aws.png"
        },
        {
          "techName": "Node Js",
          "techImage": "/assets/images/nodejs.png"
        }
      ]
    }
  },
  "processSection": {
    "description": "Jar was a disruptive app with the potential to quickly become the best app for digital gold investment. Knowing this, we wanted to be able to implement solutions that could be scaled at the drop of a hat. After participating in inspiring workshops and brainstorming sessions with the client, we began working on creating the app. Our team used a variety of technologies to make the client’s vision come true. We used Node, PostgreSQL, AWS, and React to build an app that would meet all their needs."
  },
  "resultSection": {
    "description": "After a grueling development process, what resulted was the best digital gold investment app that the client could hope to get. We not only helped the client launch their product successfully, but also integrated a highly-functional payment gateway system. We also built a highly secure infrastructure for their backend, as well as a robust content management system.\n The highlight of the project was getting positive feedback and reviews from the client, with the understanding that they will work with us on all future projects!",
    "image": "/assets/caseStudy/mobiles.png"
  },
  "otherServicesSection": {
    "title": "Browse through other services that we provide",
    "data": [
      {
        "serviceImage": "/assets/caseStudy/StaffAugmentation.png",
        "serviceDescription": "We find the best Talent for you!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      },
      {
        "serviceImage": "/assets/caseStudy/buildmanage.png",
        "serviceDescription": "Not just Building, We also Manage your Products!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      }
    ]
  }
}