{
  "heroSection": {
    "companyLogo": "/assets/caseStudy/stockalLogo.png",
    "description": "Empowering global investors with intelligent tools, diverse options, and real-time insights. Make informed decisions confidently in a user-friendly platform.",
    "backgroundStyle": "background: #162542;color: #ffffff;"
  },
  "challenges_Services_Section": {
    "CHALLENGES_DATA": {
      "challengeLogo": "/assets/svgs/stockalchallengeLogo.png",
      "ChallengeTitle": "The Challenge",
      "ChallengeDescription": "Stockal approached us with a challenge that got the whole team excited - we were to be a part of this revolutionary platform’s journey by being a continuous development partner, which meant that we were not just building a one-time deliverable, but also going to work on upgrades and new features in the future.",
      "BriefTitle": "Our brief was to:",
      "BriefPoints": [
      "Create a reliable platform that got potential investors excited",
      "Ensure payment gateways and other third-party integrations were seamless",
      "Create a platform with ample scope for scalability and change",
      "Continue to work on updates and upgrades"
      ],
      "months": "5",
      "countryName": "India"
    },
    "SERVICES_PROVIDED_DATA": {
      "data": [
        {
          "serviceLogo": "/assets/svgs/BusinessProcesses.svg",
          "serviceName": "Data Migration"
        },
        {
          "serviceLogo": "/assets/svgs/WebDevelopmentLogo.svg",
          "serviceName": "New APIs Creation"
        },
        {
          "serviceLogo": "/assets/svgs/uxLogo.svg",
          "serviceName": "Backend for CMS"
        }
      ]
    },
    "TECHNOLOGIES_USED_DATA": {
      "imagesData": [
        {
          "techName": "Node Js",
          "techImage": "/assets/images/nodejs.png"
        },
        {
          "techName": "PostgreSQL",
          "techImage": "/assets/images/postgresql.png"
        },
        {
          "techName": "AWS",
          "techImage": "/assets/images/aws.png"
        },
        {
          "techName": "React",
          "techImage": "/assets/frontend/react-icon.png"
        },
        {
          "techName": "Amazon SQS",
          "techImage": "/assets/images/amazonsqs.svg"
        },
        {
          "techName": "Python Spark",
          "techImage": "/assets/svgs/pythonSpark.svg"
        }
      ]
    }
  },
  "processSection": {
    "description": "The Process: We started off the project by scheduling a series of workshops with the client to better understand the value they are contributing to their clients as well as the unique offerings for the customers. Stockal had a lot of integrations and hence requirement gathering was an important process to get full clarity on the project. Being a b2c product, Stockal wanted to be flexible in terms of the scale the product can achieve."
  },
  "resultSection": {
    "title":"The Result",
    "description": "Primathon's team embraced the challenge with enthusiasm and a strong belief in the market need for the product. We leveraged technologies like React, Node, AWS, PostgreSQL, Spark, and AWS SQS to build a robust platform for our client. Our contributions included seamless data migration, a powerful CMS backend, new API development, transitioning to JavaScript, and streamlining monitoring processes. The client was highly satisfied, and we continue to support them with maintenance, updates, and upgrades.",
    "image": "/assets/caseStudy/stockalResult.png"
  },
  "otherServicesSection": {
    "title": "Browse through other services that we provide",
    "data": [
      {
        "serviceImage": "/assets/caseStudy/StaffAugmentation.png",
        "serviceDescription": "We find the best Talent for you!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      },
      {
        "serviceImage": "/assets/caseStudy/buildmanage.png",
        "serviceDescription": "Not just Building, We also Manage your Products!",
        "exploreLinkText": "Explore",
        "exploreLink": "#"
      }
    ]
  }
}
